app/Observers/DebtorObserver.php

delete from `transactions` where `transactions`.`debtor_id` = 6 and `transactions`.`debtor_id` is not null
---
    public function deleting(Debtor $debtor)
    {
        $debtor->transactions()->delete();