app/Http/Livewire/Debts.php

    public function render()
    {
        if ($this->transactions === null){
            $this->transactions = Transaction::with('debtor')->where('transaction_type', 'credit')
                ->orderBy('id', $this->orderBy);
        }
        return view('livewire.transactions.debts', [
            'transactions' => $this->transactions->paginate($this->perPage),
            'debtors' => DB::table('debtors')->select(['id', 'name'])->get()
        ]);
---
select * from `debtors` where `debtors`.`id` in (1, 2, 3)
select count(*) as aggregate from `transactions` where `transaction_type` = 'credit'
select `id`, `name` from `debtors`