app/Http/Livewire/DebtorReport.php

    public function render()
    {
        if($this->debtors === null){
            $this->debtors = Debtor::with('transactions')->orderBy('created_at', 'desc');
        }
        return view('livewire.reports.debtor-report', [
            'debtors' => $this->debtors->paginate(7)
        ]);
---
select * from `transactions` where `transactions`.`debtor_id` in (2, 3)
select count(*) as aggregate from `debtors` where exists (select * from `transactions` where `debtors`.`id` = `transactions`.`debtor_id`)