app/Http/Livewire/Debtors.php

    public function create()
    {
        $validate = $this->validate([
            'name' => 'required',
            'phone' => 'required|integer|min:9|unique:debtors'
        ]);

        Debtor::create($validate);
---
insert into `debtors` (`name`, `phone`, `updated_at`, `created_at`) values ('Adidas', '887894569', '2023-04-10 21:23:57', '2023-04-10 21:23:57')

    public function delete()
    {
        $debtor = Debtor::findOrFail($this->debtor);
        $debtor->delete();
---
select * from `debtors` where `debtors`.`id` = 6 limit 1
delete from `debtors` where `id` = 6

    public function getDebtorsProperty()
    {
       return Debtor::when($this->search, function($query, $search) {
            $query->where('name', 'like', '%'. $search.'%');
        })->orderBy('id', $this->orderBy)->paginate($this->perPage);
---
select * from `debtors` order by `id` asc limit 5 offset 0
select count(*) as aggregate from `debtors`