app/Http/Livewire/DebtorHistory.php

select * from `debtors` where `debtors`.`id` = '6' limit 1
---
    public function mount($id)
    {
        $this->debtor = Debtor::findOrFail($id);