app/Http/Livewire/Home.php

    public function mount(User $user, Debtor $debtor, Transaction $transaction)
    {
        $this->user = $user->count();
---
select count(*) as aggregate from `users`