app/Http/Livewire/PaidDebts.php

select * from `debtors` where `debtors`.`id` in (1, 2)
select count(*) as aggregate from `transactions` where `transaction_type` = 'debit'
select `id`, `name` from `debtors`
---
    public function render()
    {
        if ($this->transactions === null) {
            $this->transactions = Transaction::with('debtor')->where('transaction_type', 'debit')
                ->orderBy('id', $this->orderBy);
        }
        return view('livewire.transactions.payd-debts', [
            'transactions' => $this->transactions->paginate($this->perPage),
            'debtors' => DB::table('debtors')->select(['id', 'name'])->get()
        ]);