app/Http/Livewire/TransactionHistory.php

    public function render()
    {
        if($this->transactions === null){
           $this->transactions = Transaction::query()->withAggregate('debtor', 'name')->orderByDesc('created_at');
        }
        return view('livewire.transactions.transaction-history', [
            'transactions' => $this->transactions->paginate(5)
        ]);
---
select * from `transactions` where `created_at` between '2023-04-01 00:00:00' and '2023-04-30 23:59:59' limit 5 offset 0
select `transactions`.*, (select name from `debtors` where `transactions`.`debtor_id` = `debtors`.`id` limit 1) as `debtor_name` from `transactions` order by `created_at` desc limit 5 offset 0
select count(*) as aggregate from `transactions` where `created_at` between '2023-04-01 00:00:00' and '2023-04-30 23:59:59'