app/Http/Livewire/Users.php

    public function create()
    {
        $validate = $this->validate([
            'name' => 'required|string|max:55',
            'email' => 'required|string|email|max:255|unique:users',
            'password' => 'required|min:8',
            'password_confirmation' => 'required|same:password',
        ]);

        if($this->photo) {
            $avatar = $this->photo->getClientOriginalName();
            Storage::putFileAs('/public/avatars', $this->photo, $avatar);
            $validate['avatar'] = $avatar;
        }

        $validate['password'] = bcrypt($validate['password']);

        User::create($validate);
---
insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('rock', 'test2@mail.com', '$2y$10$xkt3bUuOjlnaGcm1k8/Khu2hUL0t7zzk1AuCPZ3p//Dx3mel0mLLy', '2023-04-10 21:09:22', '2023-04-10 21:09:22')

    public function edit(int $id)
    {
        $this->resetInput();
        $user = User::findOrFail($id);
---
select * from `users` where `users`.`id` = 5 limit 1

    public function update()
    {
        $validate = $this->validate([
            'name' => 'required|string|max:55',
            'email' => 'required|string|email|max:255|unique:users,email,'.$this->user->id,
        ]);

        if($this->photo) {
            Storage::disk('avatars')->delete($this->user->avatar);
            $avatar = $this->photo->getClientOriginalName();
            Storage::putFileAs('/public/avatars', $this->photo, $avatar);
            $validate['avatar'] = $avatar;
        }


        DB::table('users')->where('id', $this->user->id)->update($validate);
---
update `users` set `name` = 'fascj', `email` = 'tabshire@example.net' where `id` = 5

    public function getUsersProperty()
    {
       return User::when($this->search, function($query, $search) {
            $query->where('name', 'like', '%'. $search.'%');
        })->select(['id', 'avatar', 'name', 'email', 'created_at'])
        ->orderBy('id', $this->orderBy)->paginate($this->perPage);
---
select `id`, `avatar`, `name`, `email`, `created_at` from `users` order by `id` asc limit 5 offset 0
select count(*) as aggregate from `users`