app/Http/Livewire/UserProfile.php

update `users` set `avatar` = '2OkyhArSH2rmvQi32PlQ6YTYHOGaTfVqfpYqYzPB.jpg', `users`.`updated_at` = '2023-04-10 12:39:26' where `id` = 1
---
    public function updatedImage()
    {
        $path = $this->image->store('/', 'avatars');

        auth()->user()->update(['avatar' => $path]);