app/Models/Transaction.php

select * from `transactions` where `transaction_type` = 'credit'
---
    public function scopeTotalDebtsPaid():float
    {
        return DB::table('transactions')->where('transaction_type', 'debit')->get()->sum('received_amount');